linear.measurement.postgres.update.original.v.1.27/postgres.op_update.threads_300.mes_11.dat
/usr/bin/java  -classpath /home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/conf:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/core/target/core-0.18.0-SNAPSHOT.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/core/target/dependency/HdrHistogram-2.1.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/core/target/dependency/jackson-core-asl-1.9.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/conf:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/target/postgrenosql-binding-0.18.0-SNAPSHOT.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/target/dependency/checker-qual-3.31.0.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/target/dependency/json-simple-1.1.1.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/target/dependency/postgresql-42.6.0.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/target/dependency/slf4j-api-1.7.25.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/target/dependency/slf4j-simple-1.7.13.jar site.ycsb.Client -t -db site.ycsb.postgrenosql.PostgreNoSQLDBClient -P ./workloads/workloada -p recordcount=15585 -threads 300 -P ./postgrenosql/conf/postgrenosql.properties
[OVERALL], RunTime(ms), 1250
[OVERALL], Throughput(ops/sec), 800.0
[TOTAL_GCS_G1_Young_Generation], Count, 1
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 6
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.48
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 6
[TOTAL_GC_TIME_%], Time(%), 0.48
[READ], Operations, 493
[READ], AverageLatency(us), 206331.28397565923
[READ], MinLatency(us), 161
[READ], MaxLatency(us), 495359
[READ], 95thPercentileLatency(us), 396543
[READ], 99thPercentileLatency(us), 427775
[READ], Return=OK, 493
[READ], Return=NOT_FOUND, 9
[UPDATE-FAILED], Operations, 14
[UPDATE-FAILED], AverageLatency(us), 280923.4285714286
[UPDATE-FAILED], MinLatency(us), 115264
[UPDATE-FAILED], MaxLatency(us), 525823
[UPDATE-FAILED], 95thPercentileLatency(us), 517119
[UPDATE-FAILED], 99thPercentileLatency(us), 525823
[CLEANUP], Operations, 300
[CLEANUP], AverageLatency(us), 7.15
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 1999
[CLEANUP], 95thPercentileLatency(us), 2
[CLEANUP], 99thPercentileLatency(us), 2
[READ-FAILED], Operations, 9
[READ-FAILED], AverageLatency(us), 219379.55555555556
[READ-FAILED], MinLatency(us), 48960
[READ-FAILED], MaxLatency(us), 425471
[READ-FAILED], 95thPercentileLatency(us), 425471
[READ-FAILED], 99thPercentileLatency(us), 425471
[UPDATE], Operations, 484
[UPDATE], AverageLatency(us), 269182.0661157025
[UPDATE], MinLatency(us), 647
[UPDATE], MaxLatency(us), 571391
[UPDATE], 95thPercentileLatency(us), 519423
[UPDATE], 99thPercentileLatency(us), 547327
[UPDATE], Return=OK, 484
[UPDATE], Return=UNEXPECTED_STATE, 14