linear.measurement.postgres.update.original.v.1.27/postgres.op_update.threads_320.mes_9.dat
/usr/bin/java  -classpath /home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/conf:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/core/target/core-0.18.0-SNAPSHOT.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/core/target/dependency/HdrHistogram-2.1.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/core/target/dependency/jackson-core-asl-1.9.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/conf:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/target/postgrenosql-binding-0.18.0-SNAPSHOT.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/target/dependency/checker-qual-3.31.0.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/target/dependency/json-simple-1.1.1.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/target/dependency/postgresql-42.6.0.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/target/dependency/slf4j-api-1.7.25.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/target/dependency/slf4j-simple-1.7.13.jar site.ycsb.Client -t -db site.ycsb.postgrenosql.PostgreNoSQLDBClient -P ./workloads/workloada -p recordcount=15585 -threads 320 -P ./postgrenosql/conf/postgrenosql.properties
[OVERALL], RunTime(ms), 931
[OVERALL], Throughput(ops/sec), 1074.1138560687432
[TOTAL_GCS_G1_Young_Generation], Count, 1
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 6
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.644468313641246
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 6
[TOTAL_GC_TIME_%], Time(%), 0.644468313641246
[READ], Operations, 482
[READ], AverageLatency(us), 162613.22614107883
[READ], MinLatency(us), 121
[READ], MaxLatency(us), 325631
[READ], 95thPercentileLatency(us), 295935
[READ], 99thPercentileLatency(us), 314879
[READ], Return=OK, 482
[READ], Return=NOT_FOUND, 13
[UPDATE-FAILED], Operations, 19
[UPDATE-FAILED], AverageLatency(us), 144105.47368421053
[UPDATE-FAILED], MinLatency(us), 567
[UPDATE-FAILED], MaxLatency(us), 312063
[UPDATE-FAILED], 95thPercentileLatency(us), 312063
[UPDATE-FAILED], 99thPercentileLatency(us), 312063
[CLEANUP], Operations, 320
[CLEANUP], AverageLatency(us), 7.0375
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 1837
[CLEANUP], 95thPercentileLatency(us), 2
[CLEANUP], 99thPercentileLatency(us), 22
[READ-FAILED], Operations, 13
[READ-FAILED], AverageLatency(us), 169751.92307692306
[READ-FAILED], MinLatency(us), 335
[READ-FAILED], MaxLatency(us), 291071
[READ-FAILED], 95thPercentileLatency(us), 283903
[READ-FAILED], 99thPercentileLatency(us), 291071
[UPDATE], Operations, 486
[UPDATE], AverageLatency(us), 164310.34362139917
[UPDATE], MinLatency(us), 546
[UPDATE], MaxLatency(us), 333823
[UPDATE], 95thPercentileLatency(us), 291071
[UPDATE], 99thPercentileLatency(us), 321791
[UPDATE], Return=OK, 486
[UPDATE], Return=UNEXPECTED_STATE, 19