linear.measurement.postgres.update.original.v.1.27/postgres.op_update.threads_420.mes_3.dat
/usr/bin/java  -classpath /home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/conf:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/core/target/core-0.18.0-SNAPSHOT.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/core/target/dependency/HdrHistogram-2.1.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/core/target/dependency/jackson-core-asl-1.9.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/conf:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/target/postgrenosql-binding-0.18.0-SNAPSHOT.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/target/dependency/checker-qual-3.31.0.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/target/dependency/json-simple-1.1.1.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/target/dependency/postgresql-42.6.0.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/target/dependency/slf4j-api-1.7.25.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/target/dependency/slf4j-simple-1.7.13.jar site.ycsb.Client -t -db site.ycsb.postgrenosql.PostgreNoSQLDBClient -P ./workloads/workloada -p recordcount=15585 -threads 420 -P ./postgrenosql/conf/postgrenosql.properties
[OVERALL], RunTime(ms), 948
[OVERALL], Throughput(ops/sec), 1054.8523206751054
[TOTAL_GCS_G1_Young_Generation], Count, 1
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 1
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.10548523206751054
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 1
[TOTAL_GC_TIME_%], Time(%), 0.10548523206751054
[READ], Operations, 469
[READ], AverageLatency(us), 169659.0106609808
[READ], MinLatency(us), 161
[READ], MaxLatency(us), 315391
[READ], 95thPercentileLatency(us), 302591
[READ], 99thPercentileLatency(us), 311807
[READ], Return=OK, 469
[READ], Return=NOT_FOUND, 16
[UPDATE-FAILED], Operations, 16
[UPDATE-FAILED], AverageLatency(us), 233519.0625
[UPDATE-FAILED], MinLatency(us), 497
[UPDATE-FAILED], MaxLatency(us), 300799
[UPDATE-FAILED], 95thPercentileLatency(us), 297727
[UPDATE-FAILED], 99thPercentileLatency(us), 300799
[CLEANUP], Operations, 420
[CLEANUP], AverageLatency(us), 22.723809523809525
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 9359
[CLEANUP], 95thPercentileLatency(us), 1
[CLEANUP], 99thPercentileLatency(us), 2
[READ-FAILED], Operations, 16
[READ-FAILED], AverageLatency(us), 228848.0
[READ-FAILED], MinLatency(us), 50016
[READ-FAILED], MaxLatency(us), 302847
[READ-FAILED], 95thPercentileLatency(us), 296703
[READ-FAILED], 99thPercentileLatency(us), 302847
[UPDATE], Operations, 499
[UPDATE], AverageLatency(us), 214180.15631262524
[UPDATE], MinLatency(us), 601
[UPDATE], MaxLatency(us), 311039
[UPDATE], 95thPercentileLatency(us), 301311
[UPDATE], 99thPercentileLatency(us), 305919
[UPDATE], Return=OK, 499
[UPDATE], Return=UNEXPECTED_STATE, 16