linear.measurement.postgres.update.original.v.1.27/postgres.op_update.threads_440.mes_17.dat
/usr/bin/java  -classpath /home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/conf:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/core/target/core-0.18.0-SNAPSHOT.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/core/target/dependency/HdrHistogram-2.1.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/core/target/dependency/jackson-core-asl-1.9.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/conf:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/target/postgrenosql-binding-0.18.0-SNAPSHOT.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/target/dependency/checker-qual-3.31.0.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/target/dependency/json-simple-1.1.1.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/target/dependency/postgresql-42.6.0.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/target/dependency/slf4j-api-1.7.25.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/target/dependency/slf4j-simple-1.7.13.jar site.ycsb.Client -t -db site.ycsb.postgrenosql.PostgreNoSQLDBClient -P ./workloads/workloada -p recordcount=15585 -threads 440 -P ./postgrenosql/conf/postgrenosql.properties
[OVERALL], RunTime(ms), 1251
[OVERALL], Throughput(ops/sec), 799.3605115907275
[TOTAL_GCS_G1_Young_Generation], Count, 1
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 4
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.31974420463629094
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 4
[TOTAL_GC_TIME_%], Time(%), 0.31974420463629094
[READ], Operations, 463
[READ], AverageLatency(us), 292500.9978401728
[READ], MinLatency(us), 192
[READ], MaxLatency(us), 628223
[READ], 95thPercentileLatency(us), 607743
[READ], 99thPercentileLatency(us), 614911
[READ], Return=OK, 463
[READ], Return=NOT_FOUND, 24
[UPDATE-FAILED], Operations, 19
[UPDATE-FAILED], AverageLatency(us), 357192.94736842107
[UPDATE-FAILED], MinLatency(us), 522
[UPDATE-FAILED], MaxLatency(us), 601087
[UPDATE-FAILED], 95thPercentileLatency(us), 595455
[UPDATE-FAILED], 99thPercentileLatency(us), 601087
[CLEANUP], Operations, 440
[CLEANUP], AverageLatency(us), 5.206818181818182
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 1981
[CLEANUP], 95thPercentileLatency(us), 2
[CLEANUP], 99thPercentileLatency(us), 16
[READ-FAILED], Operations, 24
[READ-FAILED], AverageLatency(us), 171753.875
[READ-FAILED], MinLatency(us), 268
[READ-FAILED], MaxLatency(us), 609791
[READ-FAILED], 95thPercentileLatency(us), 592895
[READ-FAILED], 99thPercentileLatency(us), 609791
[UPDATE], Operations, 494
[UPDATE], AverageLatency(us), 367696.1518218623
[UPDATE], MinLatency(us), 544
[UPDATE], MaxLatency(us), 630271
[UPDATE], 95thPercentileLatency(us), 606207
[UPDATE], 99thPercentileLatency(us), 622591
[UPDATE], Return=OK, 494
[UPDATE], Return=UNEXPECTED_STATE, 19